jmeter/reports/create-order-1000/statistics.json
{
  "POST Create Order" : {
    "transaction" : "POST Create Order",
    "sampleCount" : 2000,
    "errorCount" : 1974,
    "errorPct" : 98.7,
    "meanResTime" : 13232.782500000007,
    "medianResTime" : 13046.0,
    "minResTime" : 655.0,
    "maxResTime" : 22156.0,
    "pct1ResTime" : 17233.9,
    "pct2ResTime" : 18368.349999999995,
    "pct3ResTime" : 19308.69,
    "throughput" : 59.77822279343635,
    "receivedKBytesPerSec" : 14.950802055623637,
    "sentKBytesPerSec" : 14.711047015572227
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 1974,
    "errorPct" : 98.7,
    "meanResTime" : 13232.782500000007,
    "medianResTime" : 13046.0,
    "minResTime" : 655.0,
    "maxResTime" : 22156.0,
    "pct1ResTime" : 17233.9,
    "pct2ResTime" : 18368.349999999995,
    "pct3ResTime" : 19308.69,
    "throughput" : 59.77822279343635,
    "receivedKBytesPerSec" : 14.950802055623637,
    "sentKBytesPerSec" : 14.711047015572227
  }
}