jmeter/reports/event-detail-load-test-redis-warm/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.280700000000029,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 979.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 18.94999999999891,
    "pct3ResTime" : 36.0,
    "throughput" : 503.49932027591757,
    "receivedKBytesPerSec" : 1504.1058796133125,
    "sentKBytesPerSec" : 83.09705578772468
  },
  "GET Event Detail" : {
    "transaction" : "GET Event Detail",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.280700000000029,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 979.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 18.94999999999891,
    "pct3ResTime" : 36.0,
    "throughput" : 503.49932027591757,
    "receivedKBytesPerSec" : 1504.1058796133125,
    "sentKBytesPerSec" : 83.09705578772468
  }
}