jmeter/reports/event-detail-load-test-redis/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.197900000000039,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 1030.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 47.0,
    "throughput" : 503.55002769525146,
    "receivedKBytesPerSec" : 1504.2573581247796,
    "sentKBytesPerSec" : 83.10542449267334
  },
  "GET Event Detail" : {
    "transaction" : "GET Event Detail",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.197900000000039,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 1030.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 47.0,
    "throughput" : 503.55002769525146,
    "receivedKBytesPerSec" : 1504.2573581247796,
    "sentKBytesPerSec" : 83.10542449267334
  }
}