jmeter/reports/create-order-500/statistics.json
{
  "POST Create Order" : {
    "transaction" : "POST Create Order",
    "sampleCount" : 5000,
    "errorCount" : 4974,
    "errorPct" : 99.48,
    "meanResTime" : 7235.913400000003,
    "medianResTime" : 7095.0,
    "minResTime" : 629.0,
    "maxResTime" : 12502.0,
    "pct1ResTime" : 8665.500000000004,
    "pct2ResTime" : 9568.75,
    "pct3ResTime" : 10349.97,
    "throughput" : 61.760418982682374,
    "receivedKBytesPerSec" : 15.370129708459942,
    "sentKBytesPerSec" : 15.198853109019492
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5000,
    "errorCount" : 4974,
    "errorPct" : 99.48,
    "meanResTime" : 7235.913400000003,
    "medianResTime" : 7095.0,
    "minResTime" : 629.0,
    "maxResTime" : 12502.0,
    "pct1ResTime" : 8665.500000000004,
    "pct2ResTime" : 9568.75,
    "pct3ResTime" : 10349.97,
    "throughput" : 61.760418982682374,
    "receivedKBytesPerSec" : 15.370129708459942,
    "sentKBytesPerSec" : 15.198853109019492
  }
}